app/controllers/chirps_controller.rb

SELECT "chirps".* FROM "chirps"
---
    def index
        # debugger
        @chirps = Chirp.all # fetch all the chirps

SELECT "chirps".* FROM "chirps" WHERE "chirps"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
    def show
        # debugger
        @chirp = Chirp.find(params[:id])

INSERT INTO "chirps" ("body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "I should not click on random buttons"], ["author_id", 1], ["created_at", "2022-08-30 00:17:42.951370"], ["updated_at", "2022-08-30 00:17:42.951370"]]
---
    def create
        # debugger
        @chirp = Chirp.new(chirp_params)
        # we don't want to immediately save the chirp to the database with
        # create, because we want to be in control of what happens if it
        # succeeds or fails.  We'll use some good old fashioned if else logic
        # to decide what to do.

        # need to add the below line so we can create a chirp
        # (we'll first get an error without it)
        @chirp.author = current_user # temporary fix until we have the notion of
        # a current_user. @chirp.author_id = User.first.id is equivalent

        if @chirp.save

SELECT "chirps".* FROM "chirps" WHERE "chirps"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "chirps" SET "body" = $1, "updated_at" = $2 WHERE "chirps"."id" = $3  [["body", "I have been updated"], ["updated_at", "2022-08-24 16:14:51.075950"], ["id", 23]]
---
    def update
        # update looks similar to create, but instead of instantiating a new
        # chirp to save to the database, we'll lookup the chirp we want to
        # update in the database using the wildcard from the Url, which we
        # find in the params object

        @chirp = Chirp.find(params[:id])

        if @chirp.update(chirp_params)

SELECT "chirps".* FROM "chirps" WHERE "chirps"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
DELETE FROM "chirps" WHERE "chirps"."id" = $1  [["id", 23]]
---
    def destroy
        @chirp = Chirp.find(params[:id])
        @chirp.destroy