app/controllers/chirps_controller.rb

    def create
        # debugger
        @chirp = Chirp.new(chirp_params)
        # we don't want to immediately save the chirp to the database with
        # create, because we want to be in control of what happens if it
        # succeeds or fails.  We'll use some good old fashioned if else logic
        # to decide what to do.

        # need to add the below line so we can create a chirp
        # (we'll first get an error without it)
        @chirp.author = User.last # temporary fix until we have the notion of
---
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]