app/controllers/users_controller.rb

    def create
        # debugger
        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "age", "political_affiliation", "password_digest", "session_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def update
        # debugger
        @user = User.find(params[:id])

        if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2, "age" = $3 WHERE "users"."id" = $4  [["email", "adventursaurus@gmail.com"], ["updated_at", "2022-08-26 15:33:55.403667"], ["age", 50], ["id", 10]]