app/models/user.rb

    def reset_session_token!
        # debugger
        self.session_token = generate_unique_session_token
        self.save!
---
UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-08-30 13:28:13.871223"], ["session_token", "[FILTERED]"], ["id", 1]]

    def generate_unique_session_token
        # debugger
        token = SecureRandom::urlsafe_base64

        while User.exists?(session_token: token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]